erp3l/src/Catalogs/СпособыРасчетаСуммПериодическихОпераций/СпособыРасчетаСуммПериодическихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыРасчетаСуммПериодическихОпераций</name>
  <attributes>
    <name>ТипПериодическихПлатежей</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидОперации</name>
    <type>
      <types>CatalogRef.УдалитьВидыОперацийБюджетирование</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаБазы</name>
    <type>
      <types>EnumRef.БазыДляРасчетаЗначенийПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаГрафикаОпераций</name>
    <type>
      <types>CatalogRef.СпособыРасчетаГрафиковПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСтавки</name>
    <type>
      <types>EnumRef.ТипыСтавокДляРасчетаПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>КапитализацияПроцентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаДней</name>
    <type>
      <types>CatalogRef.СпособыРасчетаДнейПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоДействияДифференцированнойСтавки</name>
    <type>
      <types>EnumRef.СпособОпределенияДатыНачалаДействияСтавки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДифференцированнойСтавки</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрДляРасчетаПлавающейСтавки</name>
    <type>
      <types>CatalogRef.ПараметрыДляРасчетаПериодическихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаАбсолютноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеЗначениеПараметраРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеЗначениеПараметраРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОпределенияПлавающейСтавки</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияДатыПлавающейСтавки</name>
    <type>
      <types>EnumRef.СпособыОпределенияДатыОперацииПоПериоду</types>
    </type>
  </attributes>
  <attributes>
    <name>АбсолютноеИзменениеПлавающейСтавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтносительноеИзменениеПлавающейСтавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СдвигПериодовПлавающейСтавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСдвигаПериодовПлавающейСтавки</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>EnumRef.ПредназначенияЭлементовСтруктурыОтчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриходРасход</name>
    <type>
      <types>EnumRef.ВидыДвиженийПриходРасход</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаЗагрузкаГрафиковОпераций</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперацииФИ</name>
    <type>
      <types>EnumRef.ТипыОперацийГрафикаФинансовыхИнструментов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДифференцированныеСтавки</name>
    <attributes>
      <name>НомерПериода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>18</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СпособыРасчетаСуммПериодическихОпераций/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ТипПериодическихПлатежейПриИзменении(Элемент)
	
	ПриИзмененииТипаПериодическихОпераций();	
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииТипаПериодическихОпераций()
	
	ОбновитьНаименование();
	УстановитьВидимость();
	
КонецПроцедуры // ПриИзмененииТипаПериодическихОпераций()

&НаСервере
Процедура ОбновитьНаименование()
	
	Если Объект.ТипОперацииФИ=Перечисления.ТипыОперацийГрафикаФинансовыхИнструментов.Проценты Тогда
		
		 ТекстНаименования=?(Объект.КапитализацияПроцентов,НСтр("ru = 'Сложные проценты'"),НСтр("ru = 'Проценты'"));
		 
	 Иначе
		 
		 ТекстНаименования=""+Объект.ТипОперацииФИ;
		 
	КонецЕсли;
		 	
	Если Объект.ТипОперацииФИ=Перечисления.ТипыОперацийГрафикаФинансовыхИнструментов.ОсновнойДолг Тогда
		
		ТекстНаименования=ТекстНаименования+", "+Объект.ПриходРасход;
		
	КонецЕсли;
	
	ТекстНаименования=ТекстНаименования+", "+Объект.ТипСтавки;
	
	Если Объект.ТипСтавки=Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная Тогда
		
		ТекстНаименования=ТекстНаименования+" "+Объект.Ставка+"%";
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.СпособРасчетаБазы) И (НЕ Объект.ТипОперацииФИ=Перечисления.ТипыОперацийГрафикаФинансовыхИнструментов.Проценты) Тогда
		
		ТекстНаименования=ТекстНаименования+", " + НСтр("ru = 'база'") + ": "+Объект.СпособРасчетаБазы;
		
	КонецЕсли;
	
	ТекстНаименования=ТекстНаименования+", "+Объект.СпособРасчетаГрафикаОпераций;
	
	Объект.Наименование=ТекстНаименования;
		
КонецПроцедуры // ОбновитьНаименование()

&НаКлиенте
Процедура СпособРасчетаБазыПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСтавкиПриИзменении(Элемент)
	
	ПриИзмененииТипаСтавки();
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииТипаСтавки()
	
	Если НЕ ЗначениеЗаполнено(Объект.НачалоДействияДифференцированнойСтавки) Тогда
		
		Объект.НачалоДействияДифференцированнойСтавки=Перечисления.СпособОпределенияДатыНачалаДействияСтавки.ОтНачалаДействияФинансовогоИнструмента;
		
	КонецЕсли;
	
	УстановитьВидимость();
	ОбновитьНаименование();
		
КонецПроцедуры // ПриИзмененииТипаСтавки()

&НаСервере
Процедура УстановитьВидимость()
	
	Элементы.КапитализацияПроцентов.Видимость			=(Объект.ТипОперацииФИ=Перечисления.ТипыОперацийГрафикаФинансовыхИнструментов.Проценты);
	Элементы.СтавкаАбсолютноеЗначение.Видимость			=(НЕ Объект.ТипОперацииФИ=Перечисления.ТипыОперацийГрафикаФинансовыхИнструментов.Проценты);
	Элементы.Ставка.Видимость							=(Объект.ТипСтавки=Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная);
	Элементы.ГруппаДифференцированнаяСтавка.Видимость	=(Объект.ТипСтавки=Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Дифференцированная);
	Элементы.ГруппаПлавающаяСтавка.Видимость			=(Объект.ТипСтавки=Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Плавающая);
	
	Элементы.ТипОперацииФИ.Видимость					=(НЕ Объект.ТипПериодическихПлатежей = Перечисления.ВидыФинансовыхИнструментов.РасчетыСКонтрагентами);
		
КонецПроцедуры // УстановитьВидимость() 

&НаКлиенте
Процедура СтавкаПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСпособаРасчетаГрафикаПлатежей()
	
	Объект.ПериодичностьОпределенияПлавающейСтавки		= Объект.СпособРасчетаГрафикаОпераций.Периодичность;
	Объект.СпособОпределенияДатыПлавающейСтавки			= Объект.СпособРасчетаГрафикаОпераций.СпособОпределенияДатыОперации;
	Объект.ПериодичностьДифференцированнойСтавки		= Объект.СпособРасчетаГрафикаОпераций.Периодичность;
	Объект.СдвигПериодовПлавающейСтавки					= Объект.СпособРасчетаГрафикаОпераций.СдвигПериодов;
	Объект.ПериодичностьСдвигаПериодовПлавающейСтавки	= Объект.СпособРасчетаГрафикаОпераций.ПериодичностьСдвигаПериодов;
	
	ОбновитьНаименование();
		
КонецПроцедуры // ПриИзмененииТипаСтавки()

&НаКлиенте
Процедура СпособРасчетаГрафикаПлатежейПриИзменении(Элемент)
	
	ПриИзмененииСпособаРасчетаГрафикаПлатежей();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимость();
	
	Если НЕ (ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования)) Тогда
		
		Объект.ТипСтавки=Перечисления.ТипыСтавокДляРасчетаПериодическихОпераций.Фиксированная;
		Объект.СпособРасчетаДней=Справочники.СпособыРасчетаДнейПериодическихОпераций.ГодФактМесяцФакт;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КапитализацияПроцентовПриИзменении(Элемент)
	
	ОбновитьНаименование();
	
КонецПроцедуры
